In [2]:
# import depend
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
import json
import csv
from scipy import stats
from scipy.stats import linregress
from datetime import date
import scipy.stats as st
# output_data = ""
# import 
arrest_by_state = "Resources/Table_22_Arrest_by_State_2016.csv"
income_by_state = "Resources/h08.csv"

In [4]:
# create data frames for each data set. Make sure to use the same data frames throughout 
test_data = pd.read_csv("Resources/Table_22_Arrest_by_State_2016.csv")
test_data.head()

,State,Ages,Total\nall \nclasses1,Violent\ncrime2,Property\ncrime2,Murder and\nnonnegligent\nmanslaughter,Rape3,Robbery,Aggravated\nassault,Burglary,...,Driving\nunder the\ninfluence,Liquor\nlaws,Drunkenness4,Disorderly\nconduct,Vagrancy,All other\noffenses\n(except\ntraffic),Suspicion,Curfew\nand\nloitering\nlaw\nviolations,Number\nof\nagencies,2016\nestimated \npopulation
0,ALABAMA,Under 18,4800,321,1229,15,32,109,165,318,...,28,225,31,378,2,1096,0,0,240.0,3800629.0
1,ALABAMA,Total all ages,154482,6187,18479,312,384,1177,4314,3004,...,8126,2496,7283,2129,67,69052,0,0,NaN,NaN
2,ALASKA,Under 18,1893,216,494,8,21,35,152,104,...,31,121,18,11,0,269,0,12,32.0,738566.0
3,ALASKA,Total all ages,29462,2298,3495,41,130,282,1845,538,...,3063,775,112,738,4,11340,0,12,NaN,NaN
4,ARIZONA,Under 18,22997,1020,5113,15,53,336,616,759,...,211,1668,84,1436,65,2924,0,1061,90.0,6391343.0

In [5]:
test_data2 = pd.read_csv("Resources/h08.csv")
test_data2.head()

,State,2018,Unnamed: 2,2017 (40),Unnamed: 4,2017,Unnamed: 6,2016,Unnamed: 8,2015,...,1988,Unnamed: 66,1987 (21),Unnamed: 68,1986,Unnamed: 70,1985 (20),Unnamed: 72,1984 (19),Unnamed: 74
0,NaN,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,...,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror
1,United States,"63,179",420,"61,136",322,"61,372",335,"59,039",436,"56,516",...,"27,225",139,"26,061",127,"24,897",129,"23,618",128,"22,415",102
2,Alabama,"49,936","2,423","50,865","1,094","51,113",845,"47,221","2,301","44,509",...,"19,948",912,"19,734","1,147","19,132",885,"18,333",760,"17,310",605
3,Alaska,"68,734","3,390","77,987","3,718","72,231","2,719","75,723","4,086","75,112",...,"33,103","1,183","33,233","1,497","31,356","1,017","34,782","1,089","32,356","1,473"
4,Arizona,"62,283","2,291","59,700","2,689","61,125","2,642","57,100","1,971","52,248",...,"26,435",843,"26,749",892,"25,500",718,"23,877",744,"21,425",609

In [8]:
new_df = test_data.loc[:,["State", "Ages", "Total\nall \nclasses1"]]
new_df

             State            Ages  Total\nall \nclasses1
0        ALABAMA          Under 18                   4800
1        ALABAMA    Total all ages                 154482
2           ALASKA        Under 18                   1893
3           ALASKA  Total all ages                  29462
4          ARIZONA        Under 18                  22997
..             ...             ...                    ...
97   WEST VIRGINIA  Total all ages                  39742
98       WISCONSIN        Under 18                  41813
99       WISCONSIN  Total all ages                 261400
100        WYOMING        Under 18                   3332
101        WYOMING  Total all ages                  28213

[102 rows x 3 columns]

In [9]:
new_df = new_df.rename(columns={
    "Total\nall \nclasses1": "Total Cases"
})
new_df

             State            Ages  Total Cases
0        ALABAMA          Under 18         4800
1        ALABAMA    Total all ages       154482
2           ALASKA        Under 18         1893
3           ALASKA  Total all ages        29462
4          ARIZONA        Under 18        22997
..             ...             ...          ...
97   WEST VIRGINIA  Total all ages        39742
98       WISCONSIN        Under 18        41813
99       WISCONSIN  Total all ages       261400
100        WYOMING        Under 18         3332
101        WYOMING  Total all ages        28213

[102 rows x 3 columns]

In [7]:
# grab 2016 column from H08 
# rename header

In [ ]:
# testing